/****************************************************************************
* 文 件 名: main.c
* 描    述: 蜂鸣器实验，下次程序后，蜂鸣器隔1秒响一次
****************************************************************************/
#include <ioCC2530.h>

typedef unsigned char uchar;
typedef unsigned int  uint;

#define LED1 P1_0            //定义P1.0口为LED1控制端

#define DATA_PIN P0_7        //定义P0.7口为蜂鸣器的控制口
/****************************************************************************
* 名    称: InitLed()
* 功    能: 设置LED灯相应的IO口
* 入口参数: 无
* 出口参数: 无
****************************************************************************/
void InitLed(void)
{
    P1DIR |= 0x13;           //P1.0/P1.1/P1.4定义为输出口
  
}

/****************************************************************************
* 名    称: DelayMS()
* 功    能: 以毫秒为单位延时 16M时约为535,系统时钟不修改默认为16M
* 入口参数: msec 延时参数，值越大，延时越久
* 出口参数: 无
****************************************************************************/
void DelayMS(uint msec)
{ 
    uint i,j;
    
    for (i=0; i<msec; i++)
        for (j=0; j<535; j++);
}


void main(void)
{      
    P0DIR |= 0x80;           //P0.7定义为输出口 
    InitLed();               //设置LED灯相应的IO口
    while(1)                 //死循环
    {
      DATA_PIN=1;
      P1_0=0;
      DelayMS(1000);
      DATA_PIN=0;
      P1_0=1;
      DelayMS(1000);
    } 
    
}
